ednieuw/RTCcheck/Old/ESP32_RTCcheckV005/ESP32_RTCcheckV005.ino
 char menusmall[][40] = {
 "I Menu, II long menu",
 "F Print time differences from NTP",
 "! See RTC times",
 "& Update system time all RTC times",
 "U Update system time in RTC U0-U7",
 "R Reset settings",
 "@ Restart" };
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud
 Wire.begin();
 int32_t Tick = millis(); 
 SetStatusLED(10,0,0);                                                                        // Set the status LED to red
 InitStorage();                                                                               // Load settings from storage and check validity   
 StartLeds();                                                                                 // LED RainbowCycle  
 while (!Serial) {if((millis()-Tick)>5000) break; LEDstartup(dyellow); delay(512); }          // Wait max 5 second to establish serial connection
 LEDstartup(capri); Tekstprintln("Serial started\nStored settings loaded\nLED strip started");// InitStorage and StartLEDs must be called first
 Mem.MCUrestarted++;                                                                          // MCU Restart counter     
 StoreStructInFlashMemory();                                                                  // 
 if(Mem.MCUrestarted>5) { Reset();  ResetCredentials(); }                                     // If the MCU restarts so often Reset all 
 if(Mem.UseRotary==1) {LEDstartup(pink);  InitRotaryMod(); Tekstprintln("Rotary available"); }// Start the Rotary encoder
 if(Mem.UseRotary==2) {LEDstartup(grass); InitKeypad3x1(); Tekstprintln("Keypad available"); }// Start the Keypad 3x1 
 InitDS3231Mod();     LEDstartup(dyellow);                 Tekstprintln("DS3231 RTC started");// Start the DS3231 RTC-module even if not installed. It can be turned it on later in the menu
 if(Mem.BLEOn)     { LEDstartup(blue); StartBLEService();  Tekstprintln("BLE started"); }     // Start BLE service // Set the status LED to blue
 if(Mem.WIFIOn)    { LEDstartup(darkviolet); ConnectWIFI();Tekstprintln("WIFI started");}     // Start WIFI and optional NTP if Mem.WIFIOn = 1 
 Previous_LDR_read = ReadLDR();                                                               // Set the initial LDR reading
 GetTijd(true); Tekstprintln("");                                                             // Get the time and print it

 setupRTCs();  //RTC8
 SWversion();                                                                                 // Print the menu + version 
 LEDstartup(green);                                                                           // Set the status LED to green                                  
 Mem.MCUrestarted = 0;                                                                        // Startup went well; Set MCUrestart counter to 0    
 StoreStructInFlashMemory();                                                                  // 
 msTick = millis();                                                                           // start the seconds loop counter
}

//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;                                                                               // a counter to check the speed of the loop
 CheckDevices();                                                                              // Check input from devices
 EverySecondCheck();                                                                          // Enter the command structure
// Every5SecondCheck(); 
}

//--------------------------------------------                                                //
// COMMON Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 SerialCheck();                                                                               // Check serial port every second 
 if (Mem.UseRotary==1) RotaryEncoderCheck(); 
 if (Mem.UseRotary==2) Keypad3x1Check();
}
//--------------------------------------------                                                //
// COMMON Update routine 
// Performs tasks every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static int Toggle = 0;
 uint32_t msLeap = millis() - msTick;                                                         // 
 if (msLeap >999)                                                                             // Every second enter the loop
 {
  msTick = millis();
  GetTijd(false);                                                                             // Get the time for the seconds 
  Toggle = 1-Toggle;                                                                          // Used to turn On or Off Leds
  UpdateStatusLEDs(Toggle);
  DimLeds(TestLDR);                                                                           // Every second an intensity check and update from LDR reading 
  if (shouldReboot) { delay(1000);   ESP.restart(); }                                         // After finish OTA update restart
  if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                     // Enter the every minute routine after one minute; 
  Loopcounter=0;
 }  
}
//--------------------------------------------                                                //
// COMMON Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{   
lastminute = timeinfo.tm_min;  
 CheckRestoreWIFIconnectivity();                                                              // Check if WIFI is sill connected and if not restore it
 GetTijd(false);
 Displaytime();  
 DimLeds(true);   
 if(timeinfo.tm_hour != lasthour) EveryHourUpdate(); 
}
//--------------------------------------------                                                //
// COMMON Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 lasthour = timeinfo.tm_hour;
 if (!Mem.StatusLEDOn) SetStatusLED(0,0,0);                                                   // If for some reason the LEDs are ON and after a MCU restart turn them off.  
 if( (timeinfo.tm_hour == Mem.TurnOffLEDsAtHH) && (Mem.TurnOffLEDsAtHH != Mem.TurnOnLEDsAtHH))
       { LEDsAreOff = true;  ClearScreen(); }                                                 // Is it time to turn off the LEDs?
 if(timeinfo.tm_hour == Mem.TurnOnLEDsAtHH)
   { LEDsAreOff = false;   lastminute = 99;     Displaytime(); }                              // Force a minute update
 Mem.NVRAMmem[lasthour] =(byte)((SumLDRreadshour / NoofLDRreadshour?NoofLDRreadshour:1));     // Update the average LDR readings per hour
 SumLDRreadshour  = 0;
 NoofLDRreadshour = 0;
 if (timeinfo.tm_mday != lastday) EveryDayUpdate();  
}
//--------------------------------------------                                                //
// COMMON Update routine done every day
//--------------------------------------------
void EveryDayUpdate(void)
{
 lastday           = timeinfo.tm_mday; 
 Previous_LDR_read = ReadLDR();                                                            // to have a start value and reset the Min Max measurements 
 MinPhotocell      = Previous_LDR_read;                                                    // Stores minimum reading of photocell;
 MaxPhotocell      = Previous_LDR_read;                                                    // Stores maximum reading of photocell;
 if(DS3231Installed && !Mem.UseDS3231)                                                        // If on NTP time and DS3231 installed set the correct the time
   {
    sprintf(sptext, "Time set in external RTC module");
    SetDS3231Time();
    PrintDS3231Time();
  } 
 StoreStructInFlashMemory();                                                                 // Update Mem struct once a day to store Mem.NVRAM measurementd
}


//--------------------------------------------                                                //
// RTC8 
//-------------------------------------------- 

#define FILENAAM (strrchr(__FILE__, '\\') ? strrchr(__FILE__, '\\') + 1 : __FILE__) 

RTC_DS3231 rtc[MAX_RTC];                                             // RTC objecten aanmaken
static uint32_t msTickRTC8;                                              // Number of millisecond ticks since we last incremented the second counter
bool rtcActive[MAX_RTC] = {false};                                   // Array om bij te houden welke RTC's werkend zijn
int activeRTCCount     = 0;
//uint32_t  Loopcounter  = 0;                                          // Loop speed counter
//char sptext[255];                                                    // text print buffer

//--------------------------------------------                       //
// SETUP
//--------------------------------------------
void setupRTCs(void) 
{
  Serial.println("DS3231 RTC Multiplexer Test");
  Serial.println("===========================");
  sprintf(sptext,"Software: %s",FILENAAM); Tekstprintln(sptext);   
  
  Serial.print("TCA9548A search on addres 0x");                      // Test or TCA9548A is available
  Serial.print(TCA_ADDR, HEX);
  Serial.print("... ");
  
  Wire.beginTransmission(TCA_ADDR);
  if (Wire.endTransmission() == 0) {
    Serial.println("FOUND!");
  } else 
  {
    Serial.println("NOT FOUND!\ncheck wiring and power");
    while(1);                                                       // 
  }  
  Serial.println("\nScanning DS3231 modules...");                   // Scan which channels a DS3231 has
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);
    delay(50); 
    Wire.beginTransmission(0x68);                                   // DS3231 address
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {Serial.print("DS3231 found on channel "); Serial.println(i);  } 
    else {sprintf(sptext,"No DS3231 on channel %d Error : %d", i,error); Tekstprintln(sptext); }
  }
  Serial.println("\nInitialising RTC modules...");                   // Initialiseonly found RTC modules
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);                                             // Select multiplexer channel
    delay(50);
    
    Serial.print("Initialising RTC ");
    Serial.print(i);
    Serial.print("... ");
    
    // Test eerst of er een device is
    Wire.beginTransmission(0x68);
    if (Wire.endTransmission() != 0) 
    {
      Serial.println("NO DEVICE");
      continue;
    }
    
    if (!rtc[i].begin()) 
     {
      Serial.println("FAILED!");
      Serial.println("Check connection on channel " + String(i));
      rtcActive[i] = false;
     } 
    else 
     {
      Serial.println("OK!");
      rtcActive[i] = true;
      activeRTCCount++;
      DateTime newTime = rtc[i].now();                               // Check time set
      sprintf(sptext,"It's current time: %02d/%02d/%04d %02d:%02d:%02d ", newTime.day(),newTime.month(),newTime.year(),
                                                                      newTime.hour(),newTime.minute(),newTime.second());
      Tekstprintln(sptext);  
     }
    delay(100); 
   }
  sprintf(sptext,"Setup finished! %d  RTC modules active.", activeRTCCount);
  Tekstprintln(sptext); 
}

//--------------------------------------------                       //
// RTC8 Print RTC times
//-------------------------------------------- 
void PrintRTCtimes(void)
{
  for (int i = 0; i < MAX_RTC; i++)                                  // Read time of all ACTIVE RTC modules
  {
    if (!rtcActive[i]) continue;                                     // Skip non-active RTC's
    selectTCAChannel(i);
    delay(10);
    char ff[16];
    dtostrf(rtc[i].getTemperature(), 0, 2, ff); 
    DateTime now = rtc[i].now();
    sprintf(sptext,"RTC %d: %02d/%02d/%04d %02d:%02d:%02d T: %s C",
             i, now.day(),now.month(),now.year(), now.hour(),now.minute(),now.second(), ff);
    Tekstprintln(sptext);    
  }
}
//--------------------------------------------                       //
// RTC8 Calculate difference in sec from NTP
//-------------------------------------------- 
void CalcDifRTCtimes(void)
{
for (int i = 0; i < MAX_RTC; i++) 
 {  
  if (!rtcActive[i]) {RTCdiffSec[i] = 26; continue; }
  selectTCAChannel(i);
  delay(10);
  DateTime now = rtc[i].now();

  // Build a tm struct from RTC (local time)
  struct tm rtc_tm;
  rtc_tm.tm_year = now.year() - 1900;  // tm year starts at 1900
  rtc_tm.tm_mon  = now.month() - 1;    // tm months 0-11
  rtc_tm.tm_mday = now.day();
  rtc_tm.tm_hour = now.hour();
  rtc_tm.tm_min  = now.minute();
  rtc_tm.tm_sec  = now.second();

  // Convert to Unix seconds in *local time*
  time_t tRTC = mktime(&rtc_tm);

