ednieuw/RTCcheck/Old/ESP32_RTCcheckV005/ESP32_RTCcheckV005.ino
  // NTP time already in local time
  time_t tNTP = mktime(&timeinfo);

  RTCdiffSec[i] = abs(tNTP - tRTC);
 }
} 

//--------------------------------------------                       //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max = 25 seconds
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 byte Red, Green, Blue;
 CalcDifRTCtimes();                                                 // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                  // Read time of all ACTIVE RTC modules
  {
   Red = Green = Blue = 0; 
   int c = RTCdiffSec[i];
   if (c==26) Blue = 250;
   else if (c<26) 
    { 
      Red = 250 -  ((25 - c) * 10 ); 
      Green = 250 - (c * 10 ); 
    }
   ColorLed(i,FuncCRGBW( Red,  Green,  Blue, 0));  
  }
ShowLeds(); 
}

//--------------------------------------------                       //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 Tekstprint(" ");
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   sprintf(sptext,"|T%d:%2d",i,RTCdiffSec[i]);
   Tekstprint(sptext);
  }
 Tekstprint("| ");
}
//--------------------------------------------                       //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                           // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                          // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) 
   {
    sprintf(sptext,"Error selecting channel %d Error code : %d", channel,error);
    Tekstprintln(sptext);  
  }
  delay(10);                                                         // short delay after channel change
}
//--------------------------------------------                       //
// RTC8 set Time For RTC 
//--------------------------------------------
void setTimeForRTC(int rtcIndex, DateTime newTime) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                       //
// RTC8 Print Time For RTC 
//--------------------------------------------
void printTimeForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  DateTime now = rtc[rtcIndex].now();

  sprintf(sptext,"RTC %d: %s", now.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);  
}
//--------------------------------------------                       //
// RTC8 get Temperature For RTC
//--------------------------------------------
float getTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
//--------------------------------------------
void synchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) 
     {  if (rtcActive[i]) { referenceRTC = i;  break;  }  }
  if (referenceRTC == -1) 
     {  Serial.println("No active RTC's found!");   return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = rtc[referenceRTC].now();
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");

    sprintf(sptext,"Reference time of RTC  %d loops/s",referenceRTC);
  Tekstprintln(sptext); 

  Serial.println("\n=== RTC SYNCHRONISATION ===");
  Serial.print("Reference time of RTC ");
  Serial.print(referenceRTC);
  Serial.print(": ");
  Serial.println(referenceTime.timestamp(DateTime::TIMESTAMP_FULL));
  
  for (int i = 0; i < MAX_RTC; i++) 
   {
    if (!rtcActive[i]) continue;
    selectTCAChannel(i);
    delay(50);
    DateTime before = rtc[i].now();                                  // Show time before update
    Serial.print("RTC ");
    Serial.print(i);
    Serial.print(" before sync: ");
    Serial.println(before.timestamp(DateTime::TIMESTAMP_FULL));
    rtc[i].adjust(referenceTime);                                    // Update time
    delay(100); 
    DateTime after = rtc[i].now();                                   // Verify
    Serial.print("RTC ");
    Serial.print(i);
    Serial.print(" after sync:  ");
    Serial.println(after.timestamp(DateTime::TIMESTAMP_FULL));
  }
 Serial.println("Synchronisation done!\n");
}

//--------------------------------------------                       //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void setCurrentTime() 
{
   int year, month, day, hour, minute, second;                        // Parse input met sscanf (simpler than strtok)
  // int parsed = sscanf(input.c_str(), "%d %d %d %d %d %d", &year, &month, &day, &hour, &minute, &second);
  
  hour   = timeinfo.tm_hour;
  minute = timeinfo.tm_min;
  second = timeinfo.tm_sec;
  year   = timeinfo.tm_year + 1900;                                                      // Inow.year() is years since 2000 tm_year is years since 1900
  month  = timeinfo.tm_mon + 1;
  day    = timeinfo.tm_mday;
  int parsed = 6;
  if (parsed == 6) 
  {
    DateTime newTime(year, month, day, hour, minute, second);
    Serial.print("New time: ");
    Serial.println(newTime.timestamp(DateTime::TIMESTAMP_FULL));
    
    for (int i = 0; i < MAX_RTC; i++) 
    {
      if (!rtcActive[i]) continue;
      selectTCAChannel(i);
      delay(50);
      
      DateTime before = rtc[i].now();                                // Show time before update

      Serial.print("RTC ");
      Serial.print(i);
      Serial.print(" before: ");
      Serial.println(before.timestamp(DateTime::TIMESTAMP_TIME));
      
      rtc[i].adjust(newTime);
      delay(100);
     
      DateTime after = rtc[i].now();                                 // Verify
      Serial.print("RTC ");
      Serial.print(i);
      Serial.print(" na:   ");
      Serial.println(after.timestamp(DateTime::TIMESTAMP_TIME));
    }
    Serial.println("All active RTC's updated!\n");
  } 
  else {Serial.println("Wrong entry format. Try again\n"); }
}

//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(int Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    SetStatusLED((Toggle && WiFi.localIP()[0]==0) * 20, 
                 (Toggle && WiFi.localIP()[0]!=0) * 20 , 
                 (Toggle &&      deviceConnected) * 20);
    SetPCBLED09( Toggle * 10);                                                                // Left LED
    SetPCBLED10((1-Toggle) * 10);                                                             // Right LED
    SetNanoLED13((1-Toggle) * 50);                                                            // LED on ESP32 board
   }
   else
   {
    SetStatusLED(0, 0, 0); 
    SetPCBLED09(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 512. 0 is LED On max intensity
// 512 is LED off. Therefore the value is subtracted from 512 
//--------------------------------------------
void SetStatusLED(uint16_t Red, uint16_t Green, uint16_t Blue)
{
// For ESP32 with WS2812 LED   
// ColorLed(0,FuncCRGBW( Red,  Green,  Blue, 0)); 
// ShowLeds(); 

// For Arduino Nano ESP32 with  RGB LED 
 analogWrite(LED_RED,   512 - Red);                                                           // !Red (not Red) because 1 or HIGH is LED off
 analogWrite(LED_GREEN, 512 - Green);
 analogWrite(LED_BLUE,  512 - Blue);

